id: cbc48ab2-7aba-4b2e-a175-c490addad492
name: EntraID Service Principal has failed authentication
description: |
  'Monitors AADServicePrincipalSignInLogs and identifies when a Service Principal has failed authentication.'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AADServicePrincipalSignInLogs
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
  - InitialAccess
relevantTechniques:
  - T1528
  - T1552
  - T1078
query: |
  let Identities = _GetWatchlist('socManagedIdentities') | summarize ManagedIdentity = make_set(SearchKey);
  AADServicePrincipalSignInLogs
  | where ServicePrincipalName in (Identities)
  | where ResultType != 0
  | project-reorder TimeGenerated, ServicePrincipalName, ResourceDisplayName, ResultType, Location, IPAddress
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
- entityType: Account
  fieldMappings:
    - identifier: Name
      columnName: ServicePrincipalName
- entityType: IP
  fieldMappings:
    - identifier: Address
      columnName: IPAddress
suppressionDuration: 5h
suppressionEnabled: false
version: 1.0.0
kind: Scheduled

